cask_args appdir: '/Applications'

# Taps
tap "hashicorp/tap"
tap "daipeihust/tap"

# ------------------------
# Brew (CLI)
# ------------------------

# Core CLI
brew "coreutils"
brew "gawk"
brew "tree"
brew "htop"
brew "ack"
brew "fzf"
brew "fzf-tab"
brew "jq"
brew "yq"

# Networking / Web
brew "curl"
brew "wget"
brew "w3m"

# Security / Crypto
brew "gnupg"
brew "openssl@3"

# Dev / Build
brew "perl"
brew "readline"
brew "autoconf"
brew "automake"
brew "cmake"
brew "protobuf"

# VCS
brew "git"
brew "git-lfs"
brew "gh"
brew "lazygit"

# Containers / Infra
brew "devcontainer"
brew "kustomize"
brew "helm"

# CLIs / Editors
brew "cobra-cli"
brew "gemini-cli"
brew "neovim"
brew "mas"

# ------------------------
# Cask (GUI)
# ------------------------

# Terminal
cask "ghostty"

# Fonts
cask "font-fira-code-nerd-font"

# Browsers
cask "google-chrome"

# Dev / Cloud
cask "visual-studio-code"
cask "tableplus"
cask "orbstack"
cask "aws-vault-binary"

# Productivity / System
cask "hammerspoon"
cask "stats"
cask "appcleaner"

# Remote
cask "rustdesk"

# Social / Chat
cask "slack"
cask "wechat"

# Entertainment
cask "spotify"

# AI
cask "codex-app"
cask "claude"

# Misc
cask "antigravity"

# ------------------------
# Mac App Store (mas)
# ------------------------
mas "Dictionaries", id: 1380563956
mas "LINE", id: 539883307
mas "Xcode", id: 497799835
