cask_args appdir: '/Applications'

tap "hashicorp/tap"

brew "ack"
brew "perl"
brew "autoconf"
brew "automake"
brew "openssl@3"
brew "readline"
brew "cmake"
brew "coreutils"
brew "curl"
brew "fop"
brew "gawk"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "helm"
brew "htop"
brew "jq"
brew "kustomize"
brew "libtool"
brew "libxslt"
brew "libyaml"
brew "mas"
brew "mise"
brew "telnet"
brew "tree"
brew "unixodbc"
brew "wget"
brew "wxwidgets"
brew "yq"
brew "cobra-cli"
brew "protobuf"
brew "fzf"

cask "appcleaner"
cask "aws-vault-binary"
cask "font-fira-code"
cask "google-chrome" 
# cask "microsoft-excel"
# cask "microsoft-powerpoint"
# cask "microsoft-word"
# cask "windows-app"
cask "raycast"
cask "stats"
cask "orbstack"
cask "tableplus"
cask "visual-studio-code"
cask "rustdesk" 
cask "spotify"
cask "slack"
cask "wechat"
cask "ghostty"

mas "Dictionaries", id: 1380563956
mas "LINE", id: 539883307
mas "Xcode", id: 497799835
